# Задача 2: Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

a = int(input("Введите число: "))
summ = 0
while a > 0:
    summ = summ + (a % 10)
    a = a // 10

print(f"Сумма цифр = {summ}")